Dlubal.RFEM5.LineRelease
Line release parameters

Dlubal.RFEM5.LineRelease.No
Number

Dlubal.RFEM5.LineRelease.ID
Identifier

Dlubal.RFEM5.LineRelease.Comment
Comment

Dlubal.RFEM5.LineRelease.Tag
Tag

Dlubal.RFEM5.LineRelease.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.LineRelease.LineNo
Line number

Dlubal.RFEM5.LineRelease.TypeNo
Line release type number

Dlubal.RFEM5.LineRelease.AxisSystem
Type of local axis system

Dlubal.RFEM5.LineRelease.AxisSystemFromObjectNo
Take local axis system from object number

Dlubal.RFEM5.LineRelease.HelpNodePlane
Help node in plane

Dlubal.RFEM5.LineRelease.Rotation
Line release rotation via angle Β

Dlubal.RFEM5.LineRelease.ReleasedMembers
List of released members numbers

Dlubal.RFEM5.LineRelease.ReleasedSurfaces
List of released surfaces numbers

Dlubal.RFEM5.LineRelease.ReleasedSolids
List of released solids numbers

Dlubal.RFEM5.LineRelease.Location
Location of line release

Dlubal.RFEM5.LineRelease.GeneratedLineNo
Generated release line number

Dlubal.RFEM5.LineRelease.DefinitionNodes
Use these nodes as the definition nodes